import { Handshake } from "../models/Handshake";
// ✌🤞🖖🤘🤙💪👈👉☝👆🖕👇🖐✋👌👍👎✊👊🤛🤜🤚👋🤟🤏✍👏👐🙌🤲🥊🧤🙏🤝💅🦾☝✌✍ 🤗🤔😱🤫🤭
//😀😃😄😁😆😅🤣😂🙂🙃😉😊😇🥰😍🤩😘😗☺️😚😙😋😛😜😝🤑🤗🤭🤫🤔🤐🤨😐😑😶😶‍🌫️😏😒🙄😬🤥😌😔😪🤤😴😷🤒🤕🤢🤮🤧🥵🥶😵🤯🤠🥳🥸😎🤓🧐😕😟🙁☹️😮😯😲😳🥺😦😧😨😰😥😢😭😱😖😣😞😓😩😫🥱😤😮‍💨😪😵‍💫🤯‍♂️🤯‍♀️😶‍🌫️
const handshakes = [
  new Handshake(1, "✋", 0, 180, 0.85, 10),
  new Handshake(2, "🖐", 0, 189, 0.85, 10),
  new Handshake(3, "🤛", 90, 270, 0.85, 0),
  new Handshake(4, "✊", 0, 180, 0.95, 0),
  new Handshake(5, "👍", 0, 0, 0.85, 10),
  new Handshake(6, "👋", 0, 180, 0.85, 10),
  new Handshake(7, "✌", 0, 180, 0.85, 10),
  new Handshake(8, "🤙", 0, 180, 0.85, 10),
  new Handshake(9, "🖖", 0, 180, 0.85, 10),
  new Handshake(10, "🤟", 0, 180, 0.85, 10),
  new Handshake(11, "🙏", 0, 180, 0.85, 10),
  new Handshake(12, "🥊", 0, 180, 0.85, 0),
  new Handshake(13, "🤨", 0, 0, 1, -10),
  new Handshake(14, "🤛 🤛", 90, 270, 0.85, 0),
  new Handshake(16, "😮", 0, 0, 1, -10),
  new Handshake(17, "☝️", 0, 0, 0.85, 0, 1, -1),
  new Handshake(18, "👈", 0, 0, 0.85, 0, 1, -1),
  new Handshake(19, "👍 👍", 0, 0, 0.75, 10, -1, 1),
  new Handshake(20, "🤚", 30, 30, 0.55, 10, -1, 1),
  new Handshake(21, "🤲", 0, 180, 0.85, 10),
  new Handshake(22, "🙂", 0, 0, 1, -10),
  new Handshake(23, "😠", 0, 0, 1, -10),
  new Handshake(24, "☹️", 0, 0, 1, -10),
  new Handshake(25, "😐", 0, 0, 1, -10),
  new Handshake(26, "💪", 0, 0, 0.85, 0, 1, -1),
  new Handshake(27, "😎", 0, 0, 1, -10),
];

export default handshakes;
